# 반복문 연습
# 파이썬에서 반복문은  for / while 2개가 있음.

"""
while ( 조건문 ) :
    실행문1
    실행문2
"""

n = 0
while( n < 10 ) :
    print(n)
    n += 1
print("=" * 40)

# while을 이용하여
# 1~100까지의 합계를 구하세요
n = 1
sum = 0
while( n <= 100 ) :
    sum = sum + n
    n += 1
print(f"1 ~ 100까지의 합계는 {sum}입니다.")
print("=" * 40)


# while/if를 이용하여
# 1~100까지의 짝수 합계를 구하세요
n = 1
sum = 0
while( n <= 100 ) :
    if n % 2 == 0 :
        sum = sum + n
    n = n + 1
print(f"1 ~ 100까지의 짝수 합계는 {sum}입니다.")
print("=" * 40)

#다음 코드에 break 문을 이용하여
#1~100까지 출력하시오.
n = 1
while True :
    print(n)    
    if n >= 100 :
        break
    n = n + 1
print("=" * 40)

#다음 코드에 continue 문을 이용하여
#1~100까지 홀수만 출력하시오.
n = 0 
while n < 100 :
    n += 1
    if n % 2 == 0 :
        continue
    print(n)
print("=" * 40)

#for 문 연습
"""    
for 값 in 목록 :
    실행문1
    실행문2
"""
s = "abcdefghijklmnopqrstu"
for word in s :
    print(word)
print("=" * 40)

# range() 함수
# range(시작값,종료값,증감값=1)

# 0 ~ 10까지 출력하세요.
for n in range(0,11) :
    print(n)
print("=" * 40)
    
# 0 ~ 10까지 짝수만 출력하세요.
for n in range(0,11,2) :
    print(n)
print("=" * 40)

# 10 ~ 0까지 출력하세요.
for n in range(10,-1,-1) :
    print(n)
print("=" * 40)

# for문을 이용해서 1부터 100까지 더하세요
sum = 0
for n in range(1,101) :
    sum = sum + n
print(sum)    
print("=" * 40)

#for 문을 이용하여 구구단을 구현하시오.
#변수명은 x, y를 이용하세요.
for x in range(1,10) :
    for y in range(1,10) :
        #print(f"{x} x {y} = { x * y }")
        print("%2d x %2d = %2d" % (x,y,x*y))
    print("-" * 20)


"""
아래와 같이 별을 출력하세요.
*
**
***
****
*****
"""
for row in range(1,6) :
    print("*" * row)
    
for row in range(1,6) :
    for col in range(1,row+1):
        print("*",end = "")
    print("")

"""
아래와 같이 별을 출력하세요.
*****
****
***
**
*
"""
for row in range(1,6) :
    for col in range(6 - row,1, -1) :
        print("*", end="")
    print("")

# for문을 이용하여 오른쪽 직각 삼각형을 출력하시오.
# *
# **
# ***
# ****
# *****
for x in range(1,6) : # 1,2,3,4,5
    print("*" * x)
print("=" * 20)

# for문을 이용하여 뒤집어진 오른쪽 직각 삼각형을 출력하시오.
# *****
# ****
# ***
# **
# *
for x in range(5,0,-1) : # 5,4,3,2,1
    print("*" * x)
    # "*" : 5,4,3,2,1
print("=" * 20)

# for문을 이용하여 왼쪽 직각 삼각형을 출력하시오.
#     *
#    **
#   ***
#  ****
# *****
for x in range(1,6) : # 1,2,3,4,5
    print(" " * (5-x), "*" * x, sep = "")
    # " " : 4,3,2,1,0
    # "*" : 1,2,3,4,5
print("=" * 20)

# for문을 이용하여 뒤집어진 왼쪽 직각 삼각형을 출력하시오.
# *****
#  ****
#   ***
#    **
#     *
for x in range(5,0,-1) : # 5,4,3,2,1
    print(" " * (5-x), "*" * x, sep = "")
    # " " : 0,1,2,3,4
    # "*" : 5,4,3,2,1
print("=" * 20)

# for문을 이용하여 피라미드를 출력하시오.
#     *
#    ***
#   *****
#  *******
# *********
for x in range(1,6) :
    print(" " * (5-x), "*" * (2*x-1), sep = "")
    # " " : 4,3,2,1,0
    # "*" : 1,3,5,7,9
print("=" * 20)

# for문을 이용하여 역피라미드를 출력하시오.
# *********
#  *******
#   *****
#    ***
#     *
for x in range(5,0,-1) :
    print(" " * (5-x), "*" * (2*x-1), sep = "")
    # " " : 0,1,2,3,4
    # "*" : 9,7,5,3,1
print("=" * 20)

# for문을 이용하여 마름모꼴을 출력하시오.
#     *
#    ***
#   *****
#  *******
# *********
#  *******
#   *****
#    ***
#     *
for x in range(1,6) :
    print(" " * (5-x), "*" * (2*x-1), sep = "")
    # " " : 4,3,2,1,0
    # "*" : 1,3,5,7,9
for x in range(4,0,-1) :
    print(" " * (5-x), "*" * (2*x-1), sep = "")
    # " " : 1,2,3,4
    # "*" : 7,5,3,1
print("=" * 20)

# for문을 한번만 이용하여 마름모꼴을 출력하시오.
#     *
#    ***
#   *****
#  *******
# *********
#  *******
#   *****
#    ***
#     *
for x in range(-4,5) : # -4,-3,-2,-1,0,1,2,3,4
    if x < 0 :
        print(" " * (-x), "*" * (9+2*x), sep = "")
        # " " : 4,3,2,1,0
        # "*" : 1,3,5,7,9
    else :
        print(" " * x, "*" * (9-2*x), sep = "")
        # " " : 1,2,3,4
        # "*" : 7,5,3,1
print("=" * 20)

# for문을 두번 이용하여 모래시계를 출력하시오.
# *********
#  *******
#   *****
#    ***
#     *
#    ***
#   *****
#  *******
# *********
for x in range(5,0,-1) : # 5,4,3,2,1 
    print(" " * (5-x), "*" * (2*x-1), sep = "") # 9,7,5,3,1
    # " " : 0,1,2,3,4
    # "*" : 9,7,5,3,1
for x in range(2,6) : # 2,3,4,5
    print(" " * (5-x), "*" * (2*x-1), sep = "") # 2,4,6,8,10
    # " " : 3,2,1,0
    # "*" : 3,5,7,9,11
print("=" * 20)

# for문을 한번만 이용하여 모래시계를 출력하시오.
# *********
#  *******
#   *****
#    ***
#     *
#    ***
#   *****
#  *******
# *********
for x in range(-4,5) : # -4,-3,-2,-1,0,1,2,3,4
    if x < 0 :
        x = -x # 4,3,2,1,0,1,2,3,4
    print(" " * (4-x), "*" * (2*x+1), sep = "")
    # " " : 0,1,2,3,4,3,2,1,0
    # "*" : 9,7,5,3,1,3,5,7,9




